tap "hudochenkov/sshpass"
tap "lbjlaq/antigravity-manager", "https://github.com/lbjlaq/Antigravity-Manager"
tap "leoafarias/fvm"
tap "siderolabs/tap"
tap "supabase/tap"
brew "act"
brew "openssl@3"
brew "adb-enhanced"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "eza"
brew "fish"
brew "fish-lsp"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "gitleaks"
brew "libksba"
brew "openjdk@17"
brew "gradle@7"
brew "helm"
brew "k3d"
brew "kubeseal"
brew "lazygit"
brew "leptonica"
brew "libimobiledevice"
brew "libpq"
brew "libtool"
brew "libyaml"
brew "llvm"
brew "lld"
brew "luarocks"
brew "makensis"
brew "mingw-w64"
brew "neovim"
brew "openjdk@21"
brew "openssl@1.1"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "rbenv"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "swift-format"
brew "unar"
brew "xcodegen"
brew "yq"
brew "zlib"
brew "hudochenkov/sshpass/sshpass"
brew "leoafarias/fvm/fvm"
brew "siderolabs/tap/talosctl"
brew "supabase/tap/supabase"
cask "android-platform-tools"
cask "lbjlaq/antigravity-manager/antigravity-tools"
cask "copilot-cli"
cask "db-browser-for-sqlite"
cask "font-hack-nerd-font"
cask "obs"
cask "opencode-desktop"
cask "wezterm"
cargo "n8n-sync"
